app/controllers/v1/contacts_controller.rb

    def index
      page_number = params[:page].try(:[], :number)
      per_page = params[:page].try(:[], :size)

      @contacts = Contact.all.page(page_number).per(per_page)
---
SELECT "contacts".* FROM "contacts" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) AS "size", MAX(subquery_for_cache_key.collection_cache_key_timestamp) AS timestamp FROM (SELECT "contacts"."updated_at" AS collection_cache_key_timestamp FROM "contacts" LIMIT ? OFFSET ?) subquery_for_cache_key  [["LIMIT", 5], ["OFFSET", 0]]